app/controllers/templates_controller.rb

    def set_template
      @template = Template.find(params[:id])
---
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]