app/models/user.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "goldengolem0815@gmail.com"], ["LIMIT", 1]]
---
  def self.new_with_session(params, session)
	  super.tap do |user|
	    if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
	      user.email = data["email"] if user.email.blank?
	      user.location = data['location']['name'] if user.location.blank?

INSERT INTO "users" ("email", "encrypted_password", "provider", "uid", "name", "image", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "336317213851402"], ["LIMIT", 1]]
---
	def self.from_omniauth(auth)
	  where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

INSERT INTO "users" ("email", "encrypted_password", "name", "phone_num", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["name", "Eddie Cohn1"], ["LIMIT", 1]]
---
	def self.from_phone(name, number)
		where(name: name).first_or_create do |user|